
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный)Тогда
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьВидимость() 
 	СтрокаТипПолучателя = "";	
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ВыдачаДенегПодотчетнику") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь; 
		Элементы.РасчетныйСчет.Видимость = Ложь; 
		Элементы.Получатель.Видимость = Истина;
		Элементы.КассаПолучатель.Видимость = Ложь;
		СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ВзносНаличнымиВБанк")Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь; 
		Элементы.РасчетныйСчет.Видимость = Истина; 
		Элементы.Получатель.Видимость = Истина;
		Элементы.КассаПолучатель.Видимость = Ложь;
		СтрокаТипПолучателя = "СправочникСсылка.Банки";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ПередачаВДругуюКассу") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.Получатель.Видимость = Ложь;
		Элементы.КассаПолучатель.Видимость = Истина;  	
	Иначе
		Элементы.ДоговорКонтрагента.Видимость = Истина;  
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.Получатель.Видимость = Истина;
		Элементы.КассаПолучатель.Видимость = Ложь;
		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда         
        Массив = Новый Массив();
        Массив.Добавить(Тип(СтрокаТипПолучателя));    
        ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
        Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;        
	КонецЕсли; 
	
	Если Элементы.ДоговорКонтрагента.Видимость = Истина
        И ЗначениеЗаполнено(Объект.Получатель) Тогда
        Элементы.ДоговорКонтрагента.Видимость = ВидимостьДоговораКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
    КонецЕсли; 	
   КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ВыдачаДенегПодотчетнику")
	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВыдыОперацийРасходаДенег.ВзносНаличнымиВБанк"))
	И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		ТекстВопроса = "При изменении реквизита ""Вид операции"" на " + Строка(Объект.ВидОперации) + " будут очищены следующие данные:
		| - Договор контрагента
		| Продолжить?"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов)Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОпераций",ЭтаФорма,МассивОчищаемыхРеквизитов);
		ПоказатьВопрос (Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!"); 
	Иначе 
		ВидОперации = Объект.ВидОперации;
		УстановитьВидимость();  
	КонецЕсли;
   КонецПроцедуры
   
&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииВидаОпераций(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
    	Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        	Объект[Реквизит] = Неопределено;
    	КонецЦикла;
    	УстановитьВидимость();
    	ВидОперации =  Объект.ВидОперации;
	Иначе
   		Объект.ВидОперации = ВидОперации;
	КонецЕсли;
КонецПроцедуры    

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	ЭтоПоставщик = ВидимостьДоговораКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
	МассивОчищаемыхРеквизитов = Новый Массив;
	Если Не ЭтоПоставщик И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		ТекстВопроса = "При изменении реквизита ""Плательщик"" на " + Строка(Объект.Получитель) + " будут очищены следующие данные:
		| - Договор контрагента
		| Продолжить?"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов)Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПлательщика",ЭтаФорма,МассивОчищаемыхРеквизитов);
		ПоказатьВопрос (Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!"); 
	Иначе 
		Получатель = Объект.Получатель;
		УстановитьВидимость();  
	КонецЕсли;  
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры


