
&НаКлиенте
Процедура ОткрытьКартуМаршрута(Команда)
	ОткрытьФорму("БизнесПроцесс.ДорегистрацияПользователя.Форма.ФормаКартыМаршрута", Новый Структура("Объект",Объект.БизнесПроцесс));
КонецПроцедуры

//&НаСервере
//Процедура ПолученоСогласиеПриИзмененииНаСервере()
//	БизнесПроцессОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
//	Если Объект.ПолученоСогласие = "Да" Тогда 	
//		БизнесПроцессОбъект.РегистрацияПодтверждена = Истина;
//		БизнесПроцессОбъект.Записать();
//	ИначеЕсли Объект.ПолученоСогласие = "Нет" Тогда
//		БизнесПроцессОбъект.РегистрацияПодтверждена = Ложь;
//		БизнесПроцессОбъект.Записать();			
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ПолученоСогласиеПриИзменении(Элемент)
//	ПолученоСогласиеПриИзмененииНаСервере();
//КонецПроцедуры

