&НаСервере
Процедура ОбновитьКартуМаршрута()

//ОбъектПроцесс = РеквизитФормыВЗначение("БизнесПроцесс");
КартаМаршрута = БизнесПроцесс.ПолучитьОбъект().ПолучитьКартуМаршрута();

КонецПроцедуры 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ЭтаФорма.БизнесПроцесс) Тогда
		ЭтаФорма.БизнесПроцесс = Параметры.Объект;
	КонецЕсли;
	ОбновитьКартуМаршрута();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ОбновитьКартуМаршрута();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры



