

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

Движение = Движения.ДенежныеСредства.ДобавитьРасход();  
Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
Движение.БанковскийСчетКасса = Касса;
Движение.Сумма = СуммаДокумента;  
Движение.Период = Дата;


Движения.ДенежныеСредства.Записывать = Истина;
Движения.ДенежныеСредства.БлокироватьДляИзменения = Истина; 

АналитикаПроводки = ПолучитьАналитикуПроводки();
Движения.Хозрасчетный.Записывать = Истина;
Движение = Движения.Хозрасчетный.Добавить();
Движение.Период = Дата;
Движение.СчетДт = АналитикаПроводки.СчетДебета;
Движение.СчетКт = АналитикаПроводки.СчетКредита;
Движение.Сумма = СуммаДокумента;
Движение.Содержание = АналитикаПроводки.Содержание; 
БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, АналитикаПроводки.СубконтоДебета);
БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, АналитикаПроводки.СубконтоКредита);



Движения.Записать();

Запрос = Новый Запрос;
Запрос.УстановитьПараметр("Касса", Касса);
Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
Запрос.Текст=
"ВЫБРАТЬ
|    ДенежныеСредстваОстатки.БанковскийСчетКасса.Представление КАК Касса,
|    -ДенежныеСредстваОстатки.СуммаОстаток КАК Сумма
|ИЗ
|    РегистрНакопления.ДенежныеСредства.Остатки(
|            &МоментВремени,
|            БанковскийСчетКасса = &Касса
|                И ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)) КАК ДенежныеСредстваОстатки
|ГДЕ
|    ДенежныеСредстваОстатки.СуммаОстаток < 0";

Рез = Запрос.Выполнить();
Если НЕ Рез.Пустой() Тогда
    Отказ = Истина;
    Выборка = Рез.Выбрать();
    Выборка.Следующий();
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = СтрШаблон("По кассе ""%1"" недостаточно денежных средств для расхода в размере %2", Выборка.Касса, Выборка.Сумма);
    Сообщение.Сообщить();
КонецЕсли;
КонецПроцедуры
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИМатериалов") Тогда
			ДоговорКонтрагента = ДанныеЗаполнения.Договор;			
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			ВидОперации = Перечисления.ВыдыОперацийРасходаДенег.ОплатаПоставщику;
			Получатель = ДанныеЗаполнения.Поставщик;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		  	ДокументОснование = ДанныеЗаполнения.Ссылка;
			СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			ВидОперации = Перечисления.ВыдыОперацийРасходаДенег.ВозвратДенегПокупателю;
			Получатель = ДанныеЗаполнения.Клиент;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеУслуг") Тогда
			ДоговорКонтрагента = ДанныеЗаполнения.ДоговорПоставщика;			
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			ВидОперации = Перечисления.ВыдыОперацийРасходаДенег.ОплатаПоставщику;
			Получатель = ДанныеЗаполнения.Поставщик;
		КонецЕсли;
КонецПроцедуры
Функция ПолучитьАналитикуПроводки()
	ВзносНаличнымиВБанк = Перечисления.ВыдыОперацийРасходаДенег.ВзносНаличнымиВБанк;
	ОплатаПоставщику = Перечисления.ВыдыОперацийРасходаДенег.ОплатаПоставщику;
	ВозвратДенегПокупателю = Перечисления.ВыдыОперацийРасходаДенег.ВозвратДенегПокупателю;
	ВыдачаДенегПодотчетнику = Перечисления.ВыдыОперацийРасходаДенег.ВыдачаДенегПодотчетнику;
	ПередачаВДругуюКассу = Перечисления.ВыдыОперацийРасходаДенег.ПередачаВДругуюКассу;
	
	СтруктураАналитики = Новый Структура;
	СтруктураАналитики.Вставить("СчетКредита", Планысчетов.Хозрасчетный.Касса);
	СтруктураАналитики.Вставить("СубконтоКредита",Касса);
	
	Если ВидОперации = ОплатаПоставщику Тогда  
		СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
		СтруктураАналитики.Вставить("СубконтоДебета",Получатель);
		СтруктураАналитики.Вставить("Содержание", "Оплата поставщику наличными из кассы");
	ИначеЕсли ВидОперации = ВозвратДенегПокупателю Тогда
		СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
		СтруктураАналитики.Вставить("СубконтоДебета", Получатель);
		СтруктураАналитики.Вставить("Содержание", "Возврат покупателю наличными их кассы");
	ИначеЕсли ВидОперации = ВыдачаДенегПодотчетнику Тогда
		СтруктураАналитики.Вставить("СчетДебета",ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
	    СтруктураАналитики.Вставить("СубконтоДебета", Получатель);
		СтруктураАналитики.Вставить("Содержание", "Выдача денежных средств подотчетному лицу");
	ИначеЕсли ВидОперации = ВзносНаличнымиВБанк Тогда
		СтруктураАналитики.Вставить("СчетДебета",Планысчетов.Хозрасчетный.РасчетныйСчет);
		СтруктураАналитики.Вставить("СубконтоДебета",Расчетныйсчет);
		СтруктураАналитики.Вставить("Содержание",Расчетныйсчет);
	ИначеЕсли ВидОперации = ПередачаВДругуюКассу Тогда
		СтруктураАналитики.Вставить("СчетДебета",ПланыСчетов.Хозрасчетный.Касса);
		СтруктураАналитики.Вставить("СубконтоДебета",КассаПолучатель);
		СтруктураАналитики.Вставить("Содержание","Передача денежных средств в другую кассу");
	КонецЕсли;
	Возврат СтруктураАналитики;
КонецФункции
