&НаКлиенте
Процедура УстановитьВидимость()
	ЭтоСнятиеНаличныхВКассу = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.СнятиеНаличныхВКассу"));
	ЭтоОплатаПоставщику  = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ОплатаПоставщику"));
	ЭтоВозвратПокупателю = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ВозвратПокупателю"));
	ЭтоПереводНаДругойСчет = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ПереводНаДругойСчетПредприятия"));
	
	КонтрагентЯвляетсяПоставщиком = КонтрагентЯвляетсяПоставщиком(Объект.Получатель);
	
	Элементы.Получатель.Видимость = Не (ЭтоСнятиеНаличныхВКассу ИЛИ ЭтоПереводНаДругойСчет);
	Элементы.Касса.Видимость = ЭтоСнятиеНаличныхВКассу;
	Элементы.ДоговорКонтрагента.Видимость = (ЭтоОплатаПоставщику ИЛИ ЭтоВозвратПокупателю) И КонтрагентЯвляетсяПоставщиком;
	Элементы.СчетПолучатель.Видимость = ЭтоПереводНаДругойСчет;
	СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
    Если ЭтоОплатаПоставщику ИЛИ ЭтоВозвратПокупателю Тогда
        СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
    КонецЕсли;
    
    Массив = Новый Массив();
    Массив.Добавить(Тип(СтрокаТипПолучателя));
    
    ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
    Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентЯвляетсяПоставщиком(КонтрагентСсылка)
	Если ТипЗнч(КонтрагентСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонтрагентСсылка",КонтрагентСсылка);
		Запрос.УстановитьПараметр("ТипКонтрагентаКлиент",Перечисления.ТипыКонтрагентов.Клиент);
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &КонтрагентСсылка
		               |	И Контрагенты.ТипКонтрагента = &ТипКонтрагентаКлиент";
		Результат = Запрос.Выполнить();
		Возврат Результат.Пустой(); 
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный)Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
