
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный)Тогда
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИМатериалыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыИМатериалы.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
	Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИМатериалыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыИМатериалы.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ); 
	Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИМатериалыТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТоварыИМатериалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Товар) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПоставщика(СтрокаТЧ.Товар, Объект.ДатаВходящегоДокумента, Объект.Поставщик)[0];
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	
	РаботаСТабличнымичастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
	Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИМатериалыПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	ТЧ = Объект.ТоварыИМатериалы;
	МассивНоменклатуры = Новый Массив;
	Если ЗначениеЗаполнено(ТЧ) Тогда 
		Для каждого СтрокаТЧ Из ТЧ Цикл			
			МассивНоменклатуры.Добавить(СтрокаТЧ.Товар);
		КонецЦикла;
		МассивЦен = РаботаСЦенами.ПолучитьЦенуПоставщика(МассивНоменклатуры, Объект.ДатаВходящегоДокумента, Объект.Поставщик);
		инд = 0;
		Для каждого СтрокаТЧ Из ТЧ Цикл
			Если МассивЦен[инд] = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("В базе данных не найдены цены для  номенклатуры %1",СтрокаТЧ.Товар);
				Сообщение.Сообщить(); 
				инд = инд + 1; 		
				Продолжить;
			Иначе
				СтрокаТЧ.Цена = МассивЦен[инд]; 
				РаботаСТабличнымичастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
				инд = инд + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
    Объект.СуммаДокумента = Объект.ТоварыИМатериалы.Итог("Сумма")
 
КонецПроцедуры
