
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость(); 
	ИзменитьЗаголовок(); 

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()  
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент")Тогда
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.ИсточникиИнформацииОКомпании.Видимость = Истина;
		Элементы.ОсновнойДоговор.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Истина;
	Иначе 
        Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость = Ложь;
		Элементы.ИсточникиИнформацииОКомпании.Видимость = Ложь;
		Элементы.ОсновнойДоговор.Видимость = Истина;
		Элементы.Питомцы.Видимость = Ложь; 
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();  
	ИзменитьЗаголовок(); 
	ИспользоватьРодитель();
	
КонецПроцедуры

Процедура ИзменитьЗаголовок()
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент")Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О. клиента";  
		
		Иначе 
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ИспользоватьРодитель()
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент")Тогда
    Объект.Родитель = ПредопределенноеЗначение("Справочник.Контрагенты.Клиенты"); 
Иначе 
	Объект.Родитель = ПредопределенноеЗначение("Справочник.Контрагенты.Поставщики");
КонецЕсли;
КонецПроцедуры     
                          
