
&НаСервере
Процедура ЗаполнитьДанныеПоПродажамНаСервере() 
	Объект.Начисления.Очистить();
	ДатаНачала = НачалоМесяца(Объект.ПериодНачисления);
	ДатаОкончания = КонецМесяца(Объект.ПериодНачисления);
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	              |	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
	              |ИЗ
	              |	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ПродажиОбороты.Сотрудник";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания); 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ПоказательРасчета = Выборка.СуммаОборот;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоКоду("ПРОЦПРОД");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоПродажам(Команда)
	ЗаполнитьДанныеПоПродажамНаСервере();
КонецПроцедуры
