
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	                 |	ПоступлениеУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	                 |	СУММА(ПоступлениеУслугУслуги.Сумма) КАК Сумма,
	                 |	ПоступлениеУслугУслуги.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета,
	                 |	ПоступлениеУслугУслуги.Номенклатура КАК Номенклатура
	                 |ИЗ
	                 |	Документ.ПоступлениеУслуг.Услуги КАК ПоступлениеУслугУслуги
	                 |ГДЕ
	                 |	ПоступлениеУслугУслуги.Ссылка = &Ссылка
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ПоступлениеУслугУслуги.СтатьяЗатрат,
	                 |	ПоступлениеУслугУслуги.Номенклатура.СчетБухгалтерскогоУчета,
	                 |	ПоступлениеУслугУслуги.Номенклатура";
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  
	  Пока Выборка.Следующий() Цикл  
	  Движение = Движения.УчетЗатрат.Добавить();
	  Движение.Период = Дата;
	  ЗаполнитьЗначенияСвойств(Движение,Выборка); 
	  
	  Движение = Движения.Хозрасчетный.Добавить();
	  Движение.Период = Дата; 
	  Движение.Сумма = Выборка.Сумма; 
	  Движение.Содержание = "Отражено поступление услуг от поставщика";
	  Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
	  Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками; 
	  //БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Выборка.СтатьяЗатрат);
	  //БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Поставщик);
	  Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.СтатьяЗатрат;
	  Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = Поставщик;

   	  КонецЦикла;
КонецПроцедуры
