
Функция createUserPOST(Запрос)  
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
		ЧтениеJSON.Закрыть();
		
		НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя(); 
		НовыйПользовательИБ.Имя = ДанныеЗапроса.name;
		НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		НовыйПользовательИБ.Записать(); 
		
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;  
		НовыйПользователь.Наименование = НовыйПользовательИБ.Имя;
		
		
		НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКлиент.Родитель = Справочники.Контрагенты.Клиенты;
		НовыйКлиент.Наименование = НовыйПользователь.Наименование;
		НовыйКлиент.КонтактныйТелефон = ДанныеЗапроса.tel;
		НовыйКлиент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент;
		НовыйКлиент.Комментарий = "Зарегистрирован через мобильное приложение";
		НовыйКлиент.Записать();
		
		НовыйПользователь.Клиент = НовыйКлиент.Ссылка; 
		НовыйПользователь.Записать();
		
		
		ТекстОтвета = "Регистрация прошла успешно";
		Ответ = Новый HTTPСервисОтвет(200);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		ТекстОтвета = "Произошла ошибка при регистрации";
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ;
	
КонецФункции
