
&НаКлиенте
Процедура ПризнакБессрочногоДоговораПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ПризнакБессрочногоДоговора Тогда
		Элементы.ДатаОкончанияДоговора.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда
			Объект.ДатаОкончанияДоговора = "0001,01,01";
		КонецЕсли;
	Иначе 
		Элементы.ДатаОкончанияДоговора.Видимость = Истина;
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры   

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	
	НомерДоговораДляНаименования = ?(ЗначениеЗаполнено(Объект.НомерДоговора), "№ " + Объект.НомерДоговора + " ","");
	ДатаДоговораДляНаименования = ?(ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора), "от " + Формат(Объект.ДатаЗаключенияДоговора,"ДЛФ=Д") + " г.","");
	Объект.Наименование = НомерДоговораДляНаименования + ДатаДоговораДляНаименования;
		
КонецПроцедуры;  
                                  
		     
			
