Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(СторонаОбмена)Экспорт
Запрос = Новый Запрос;
Запрос.УстановитьПараметр("СторонаОбмена", СторонаОбмена);
Запрос.Текст = "ВЫБРАТЬ
               |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
               |	Контрагенты.Ссылка КАК Контрагент
               |ИЗ
               |	Справочник.Контрагенты КАК Контрагенты
               |ГДЕ
               |	Контрагенты.Ссылка = &СторонаОбмена";

Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();

Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
    И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
    возврат Ложь;
Иначе
    возврат Истина;
КонецЕсли;
КонецФункции