Процедура РассчитатьСуммуНачисления() Экспорт
	ДнейБольничногоЗаСчетРаботодателя = 3;
	Для каждого Движение Из ЭтотОбъект Цикл
	
		Если Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда
			Оклад = Движение.ПоказательРасчета;
			ОтработаноЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
			НормаЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистрарасчета.ПериодДействия).Итог("КоличествоЧасов");
			РезультатРасчета = Оклад * ОтработаноЧасов / НормаЧасов;
			Движение.Сумма = РезультатРасчета;
			ЭтотОбъект.Записать(,Истина);  
		ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда
			Оклад = Движение.ПоказательРасчета;
			СтоимостьДняБолезни = Оклад * 24 / 730;
			КоличествоДнейБолезни = (КонецДня(Движение.ПериодДействияКонец) + 1 - Движение.ПериодДействияНачало)/86400;
			Если КоличествоДнейБолезни <= ДнейБольничногоЗаСчетРаботодателя Тогда
				РезультатРасчета = СтоимостьДняБолезни * КоличествоДнейБолезни;  
				ДнейБольничногоЗаСчетРаботодателя = ДнейБольничногоЗаСчетРаботодателя - КоличествоДнейБолезни;
			Иначе
				РезультатРасчета = ДнейБольничногоЗаСчетРаботодателя * СтоимостьДняБолезни;
				ДнейБольничногоЗаСчетРаботодателя = 0; 
			КонецЕсли;
			Движение.Сумма = РезультатРасчета;
		    ЭтотОбъект.Записать(,Истина);
		ИначеЕсли Движение.ВидРасчета.Предопределенный = Ложь Тогда
			СуммаРасчета = Неопределено;
			ФормулаРасчета = Движение.ВидРасчета.ФормулаРасчета;
			Выполнить(ФормулаРасчета);
			Движение.Сумма = РезультатРасчета;
			ЭтотОбъект.Записать(,Истина);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Стршаблон("Для вида расчета %1 не задана формула расчета!", Движение.ВидРасчета);
			Сообщение.Сообщить();
		КонецЕсли;
	
	КонецЦикла;  
КонецПроцедуры