
Процедура ОбработкаПроведения(Отказ, Режим)  
	
	Движения.ТоварыНаСкладах.Записывать = Истина; 
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	                              |	ПеремещениеТоваровТовары.Товар КАК Номенклатура,
	                              |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
	                              |ИЗ
	                              |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                              |ГДЕ
	                              |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	ПеремещениеТоваровТовары.Товар";    
	
	 ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Движение = Движения.ТоварыНаСкладах.Добавить(); 		 
		 Движение.Период = Дата;                          
		 Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		 Движение.Количество = ВыборкаДетальныеЗаписи.Количество; 
		 Движение.Склад = СкладПолучатель;  
		 Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
		 
		 Движение = Движения.ТоварыНаСкладах.Добавить(); 
		 Движение.Период = Дата;                          
		 Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		 Движение.Количество = ВыборкаДетальныеЗаписи.Количество;		 
	   	 Движение.Склад = СкладОтправитель;
		 Движение.ВидДвижения = ВиддвиженияНакопления.Расход;
		
	 КонецЦикла;    									  

	КонецПроцедуры
