
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Параметрысеанса.ТекущийПользователь;
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Процедура РасчетОбщейСуммыДокумента()
  Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент) 
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(	СтрокаТЧ.Номенклатура) Тогда 
		СтрокаТЧ.СтатьяЗатрат = ПолучитьСтатьюЗатратПоНоменклатуре(СтрокаТЧ.Номенклатура);
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПоставщика(СтрокаТЧ.Номенклатура, Объект.ВходящаяДата, Объект.Поставщик)[0];
	КонецЕсли;	
	
	РасчетОбщейСуммыДокумента();
	КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент) 
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	РасчетОбщейСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент) 
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	РасчетОбщейСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	РасчетОбщейСуммыДокумента();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатьюЗатратПоНоменклатуре(Номенклатура)
Запрос = Новый Запрос;
Запрос.УстановитьПараметр("Ссылка", Номенклатура);
Запрос.Текст=
"ВЫБРАТЬ
|    Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
|ИЗ
|    Справочник.Номенклатура КАК Номенклатура
|ГДЕ
|    Номенклатура.Ссылка = &Ссылка";
Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();
возврат Выборка.СтатьяЗатрат;
КонецФункции

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	ТЧ = Объект.Услуги;
	МассивНоменклатуры = Новый Массив;
	Если ЗначениеЗаполнено(ТЧ) Тогда 
		Для каждого СтрокаТЧ Из ТЧ Цикл			
			МассивНоменклатуры.Добавить(СтрокаТЧ.Номенклатура);
		КонецЦикла;
		МассивЦен = РаботаСЦенами.ПолучитьЦенуПоставщика(МассивНоменклатуры, Объект.ВходящаяДата, Объект.Поставщик);
		инд = 0;
		Для каждого СтрокаТЧ Из ТЧ Цикл
			Если МассивЦен[инд] = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("В базе данных не найдены цены для  номенклатуры %1",СтрокаТЧ.Номенклатура);
				Сообщение.Сообщить(); 
				инд = инд + 1; 		
				Продолжить;
			Иначе
				СтрокаТЧ.Цена = МассивЦен[инд];
				РаботаСТабличнымичастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
				инд = инд + 1;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;  
	РасчетОбщейСуммыДокумента();
КонецПроцедуры

