
Процедура КлиентПодтвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РегистрацияПодтверждена;
КонецПроцедуры


Процедура ПолучитьПодтверждениеРегистрацииКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Наименование  = "Получить согласие клиента " + Пользователь.Наименование + " на регистрацию"; 
		ФормируемаяЗадача.Предмет = Пользователь.Ссылка;
		ФормируемаяЗадача.ОписаниеЗадачи = СтрШаблон("Из мобильного приложения поступила заявка на регистрацию пользователя.Необходимо созвониться с клиентом %1 по телефону %2 и получить согласие на регистрацию, а так же дозаполнить карточку клиента - ФИО, дату рождения, сведения о питомцах и другие данные, которые клиент готов предоставить", Пользователь.Наименование, Пользователь.Клиент.КонтактныйТелефон); 
	КонецЦикла;
	
КонецПроцедуры


Процедура ПометкаНаУдалениеПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
	Пользователь.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);
КонецПроцедуры


Процедура ПолучитьПодтверждениеРегистрацииКлиентаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	БизнесПроцесс = Задача.БизнесПроцесс;
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ДорегистрацияПользователя.ТочкиМаршрута.ПолучитьПодтверждениеРегистрацииКлиента Тогда 
		Отказ =  НЕ ЗначениеЗаполнено(Задача.ПолученоСогласие); 
		Если Отказ = Истина Тогда
			Сообщить("Подтвердите согласие клиента!");
		Иначе 
			Если Задача.ПолученоСогласие = "Да" Тогда 
				БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
				БизнесПроцессОбъект.РегистрацияПодтверждена = Истина;
				БизнесПроцессОбъект.Записать();
				ЭтотОбъект.Прочитать();
			Иначе
				БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
				БизнесПроцессОбъект.РегистрацияПодтверждена = Ложь;
				БизнесПроцессОбъект.Записать();
				ЭтотОбъект.Прочитать();
			КонецЕсли;
		КонецЕсли; 
	Конецесли;

КонецПроцедуры

